//Даны два числа, показать большее и меньшее число.

int a = 5, b = 5;

if (a > b) 
{
    System.Console.WriteLine("A больше Б");
}
if (a < b)
{
    System.Console.WriteLine("A не больше B");
}
if (a == b)
{
    System.Console.WriteLine("A равно B");
}
